let figures	= ['Ладья', 'Конь', 'Ферзь', 'Королева', 'Король', 'Ферзь', 'Конь', 'Ладья'];
let pawns = ['Пешка', 'Пешка', 'Пешка', 'Пешка', 'Пешка', 'Пешка', 'Пешка' , 'Пешка'];


function generateChessboard() {
<<<<<<< HEAD
	return [
		['Ч Ладья', 'Ч Конь', 'Ч Ферзь', 'Ч Королева', 'Ч Король', 'Ч Ферзь', 'Ч Конь', 'Ч Ладья'],
		['Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка' , 'Ч Пешка'],
		[null, null, null, null, null, null, null, null],
		[null, null, null, null, null, null, null, null],
		[null, null, null, null, null, null, null, null],
		[null, null, null, null, null, null, null, null],
		['Б Пешка', 'Б Пешка', 'Б Пешка', 'Б Пешка', 'Б Пешка', 'Б Пешка', 'Б Пешка' , 'Б Пешка'],
		['Б Ладья', 'Б Конь', 'Б Ферзь', 'Б Королева', 'Б Король', 'Б Ферзь', 'Б Конь', 'Б Ладья']
		['Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка' , 'Ч Пешка'],
		['Ч Ладья', 'Ч Конь', 'Ч Ферзь', 'Ч Королева', 'Ч Король', 'Ч Ферзь', 'Ч Конь', 'Ч Ладья']
	]
=======
// Тут код.
>>>>>>> bbb36a9489a2566c4b28713010049b52503331fe
}
