function generateChessboard() {
	return [
		['Ч Ладья', 'Ч Конь', 'Ч Ферзь', 'Ч Королева', 'Ч Король', 'Ч Ферзь', 'Ч Конь', 'Ч Ладья'],
		['Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка' , 'Ч Пешка'],
		[null, null, null, null, null, null, null, null],
		[null, null, null, null, null, null, null, null],
		[null, null, null, null, null, null, null, null],
		[null, null, null, null, null, null, null, null],
<<<<<<< HEAD
		['Б Пешка', 'Б Пешка', 'Б Пешка', 'Б Пешка', 'Б Пешка', 'Б Пешка', 'Б Пешка' , 'Б Пешка'],
		['Б Ладья', 'Б Конь', 'Б Ферзь', 'Б Королева', 'Б Король', 'Б Ферзь', 'Б Конь', 'Б Ладья']
=======
		['Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка', 'Ч Пешка' , 'Ч Пешка'],
		['Ч Ладья', 'Ч Конь', 'Ч Ферзь', 'Ч Королева', 'Ч Король', 'Ч Ферзь', 'Ч Конь', 'Ч Ладья']
>>>>>>> 9ccde052580a7a52e34faf983645b98dfdd5530d
	]
}
